
# region  練習球隊範例
#  
                 

players = [56,  8, 19, 14, 6, 71]   # list 球隊人數                                        
teams = ['Apple ', 'Orange', 'pineApple', 'Big Apple', 'Bananna', 'Cherry'] # list 球隊 Team

# players 總共有幾人 ? 

# Team 總共有幾隊 ? 

# 最多的人的 team 是幾人 ?

# 最多的人的 team 是哪個 team ?  即哪一隊最多人 ?

# 人數大於 10 的組別 ?

# 除了cherry組以外的 players 總數 ?

# endregion

# region 繪圖 冰島每年人口數 ? / 每年人口成長率 ?
#                                
# 近十年 2009 ~ 2018; 每年隨機 25萬 ~ 33 萬之間     
# years = np.arange(2009, 2019)
# populations=...
# endregion

# region  2d array

# Create 2d array (4*3) (value 1~12) 大於 5 的奇數 + 200

# Create a 10x10 array with random values from the "standard normal" distribution.
# find the minimum and maximum values

# endregion

# region  畫棋盤

# 周邊 0, 內部 1

# 周邊 1, 內部 0

# 棋盤 

# [[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0. 1.]
#  [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]

# [[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 1. 1. 1. 1. 1. 1. 1. 1. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]]

# [[0. 1. 0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0. 1. 0.]
#  [0. 1. 0. 1. 0. 1. 0. 1. 0. 1.]
#  [1. 0. 1. 0. 1. 0. 1. 0. 1. 0.]]

# endregion